INSERT INTO questions (question,answer) VALUES
	 (база данных;бд,Совокупность данных, хранимых в соответствии со схемой данных, манипулирование которыми выполняют в соответствии с правилами средств моделирования данных.),
	 (реляционная модель данных,Реляционная модель данных — логическая модель данных, прикладная теория построения баз данных, которая является приложением к задачам обработки данных таких разделов математики, как теория множеств и логика первого порядка),
	 (ddl,Data Definition Language. С помощью операторов этой группы мы работаем со структурой базы: удаляем, изменяем, создаем объекты и так далее. В эту группу входят операторы:

CREATE – создание объекта
ALTER – изменение объекта
DROP – удаление объекта),
	 (dml,Data Manipulation Language. С помощью этой группы операторов мы можем манипулировать данными, т.е. выгружать их, изменять, добавлять новые и так далее. В эту группу входят:

SELECT – выбор данных
INSERT – добавление данных
UPDATE – изменение данных
DELETE – удаление данных),
	 (нормализация,Процесс преобразования отношений базы данных к виду, отвечающему нормальным формам. Нормализация предназначена для приведения структуры БД к виду, обеспечивающему минимальную логическую избыточность, и не имеет целью уменьшение или увеличение производительности работы или же уменьшение или увеличение физического объёма базы данных.),
	 (субд;система управления базами данных,Программный комплекс, помогающий создавать базы данных и проводить манипуляции с данными. Именно в таких программах Вы работаете, когда прописываете свои запросы к базе через какой-то интерфейс (даже если это консолька).),
	 (первичный ключ,Ключ, который используется для идентификации объекта.),
	 (атомарность ,Неделимость атрибутов. Например, ФИО не является атомарным столбцом.),
	 (программная инженерия,Дисциплина, целью которой является создание качественного ПО, которое завершается вовремя, не превышает выделенных бюджетных средств и удовлетворяет выдвигаемым требованиям.),
	 (swebok;software engineering body of knowledge,Международный стандарт ISO/IEC TR 19759 от 2015 г, в котором описана общепринятая сумма знаний по программной инженерии.);
INSERT INTO questions (question,answer) VALUES
	 (требования ,Это свойства, которыми должно обладать ПО для адекватного определения функций, условий и ограничений выполнения ПО, а также объемов данных, технического обеспечения и среды функционирования.),
	 (потребности;needs,Отражают проблемы бизнеса, персоналии или процесса, которые должны быть соотнесены с использованием или приобретением системы. ·),
	 (функциональные требования;functional requirements,Определяют функциональность (поведение) программной системы, которая должна быть создана разработчиками для предоставления возможности выполнения пользователями своих обязанностей в рамках бизнес-требований и в контексте пользовательских требований. ·),
	 (пользовательские требования;user requirements ,Описывают цели/задачи пользователей системы, которые должны достигаться/выполняться пользователями при помощи создаваемой программной системы. Эти требования часто представляют в виде вариантов использования (Use Cases).),
	 (бизнес-требования;бизнес требования;business requirements,Определяют высокоуровневые цели организации или клиента (потребителя) - заказчика разрабатываемого программного обеспечения.),
	 (реинженерия;reengineering,Эволюция программной системы с целью упрощения ее использования, сопровождения или для адаптации к изменившейся среде выполнения

Реинженерия – совокупность моделей, методов и процессов изменения структуры, функций, элементов ПС для достижения качества функциональности добавления новых функций на основе требований пользователей.);
